sorru94/astarte-device-sdk-esp32/src/astarte_device.c
/*
 * (C) Copyright 2018-2023, SECO Mind Srl
 *
 * SPDX-License-Identifier: LGPL-2.1-or-later OR Apache-2.0
 */

#include <astarte_device.h>

#include <astarte_bson.h>
#include <astarte_bson_serializer.h>
#include <astarte_credentials.h>
#include <astarte_hwid.h>
#include <astarte_linked_list.h>
#include <astarte_list.h>
#include <astarte_pairing.h>
#include <astarte_set.h>
#include <astarte_storage.h>
#include <astarte_zlib.h>

#include <mqtt_client.h>

#include <esp_http_client.h>
#if CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
#include <esp_crt_bundle.h>
#endif
#include <esp_log.h>
#include <freertos/semphr.h>
#include <freertos/task.h>
#include <limits.h>

#define TAG "ASTARTE_DEVICE"

#define HWID_LENGTH 16
#define ENCODED_HWID_LENGTH 256
#define CREDENTIALS_SECRET_LENGTH 512
#define CSR_LENGTH 4096
#define CERT_LENGTH 4096
#define CN_LENGTH 512
#define PRIVKEY_LENGTH 8196
#define URL_LENGTH 512
#define INTROSPECTION_INTERFACE_LENGTH 512
#define TOPIC_LENGTH 512
#define REINIT_RETRY_INTERVAL_MS (30 * 1000)

#define NOTIFY_TERMINATE (1U << 0U)
#define NOTIFY_REINIT (1U << 1U)

struct astarte_device
{
    char *encoded_hwid;
    char *credentials_secret;
    char *device_topic;
    size_t device_topic_len;
    char *client_cert_pem;
    char *key_pem;
    bool connected;
    astarte_device_data_event_callback_t data_event_callback;
    astarte_device_unset_event_callback_t unset_event_callback;
    astarte_device_connection_event_callback_t connection_event_callback;
    astarte_device_disconnection_event_callback_t disconnection_event_callback;
    void *callbacks_user_data;
    esp_mqtt_client_handle_t mqtt_client;
    TaskHandle_t reinit_task_handle;
    SemaphoreHandle_t reinit_mutex;
    astarte_list_head_t interfaces_list;
    char *realm;
};

static void astarte_device_reinit_task(void *ctx);
static astarte_err_t astarte_device_init_connection(
    astarte_device_handle_t device, const char *encoded_hwid, const char *realm);
static astarte_err_t retrieve_credentials(astarte_pairing_config_t *pairing_config);
static astarte_err_t check_device(astarte_device_handle_t device);
static astarte_err_t publish_bson(astarte_device_handle_t device, const char *interface_name,
    const char *path, astarte_bson_serializer_handle_t bson, int qos);
static astarte_err_t publish_data(astarte_device_handle_t device, const char *interface_name,
    const char *path, const void *data, int length, int qos);
static void setup_subscriptions(astarte_device_handle_t device);
static void send_introspection(astarte_device_handle_t device);
static void send_emptycache(astarte_device_handle_t device);
static void send_device_owned_properties(astarte_device_handle_t device);
static void send_purge_device_properties(
    astarte_device_handle_t device, astarte_set_handle_t *set_handle);
static void on_connected(astarte_device_handle_t device, int session_present);
static void on_disconnected(astarte_device_handle_t device);
static void on_incoming(
    astarte_device_handle_t device, char *topic, int topic_len, char *data, int data_len);
static void on_control_message(
    astarte_device_handle_t device, char *control_topic, char *data, int data_len);
static void on_purge_properties(astarte_device_handle_t device, char *data, int data_len);
static astarte_err_t uncompress_purge_properties(
    char *data, int data_len, char **output, uLongf *output_len);
static void on_certificate_error(astarte_device_handle_t device);
static void mqtt_event_handler(
    void *handler_args, esp_event_base_t base, int32_t event_id, void *event_data);
static int has_connectivity();
static void maybe_append_timestamp(astarte_bson_serializer_handle_t bson, uint64_t ts_epoch_millis);
static bool interface_is_in_introspection(astarte_device_handle_t device, const char *name);
static bool interface_is_property(astarte_device_handle_t device, const char *name);
static bool interface_is_device_owned(astarte_device_handle_t device, const char *name);

astarte_device_handle_t astarte_device_init(astarte_device_config_t *cfg)
{
    astarte_device_handle_t ret = calloc(1, sizeof(struct astarte_device));
    if (!ret) {
        ESP_LOGE(TAG, "Out of memory %s: %d", __FILE__, __LINE__);
        return NULL;
    }

    ret->reinit_mutex = xSemaphoreCreateMutex();
    if (!ret->reinit_mutex) {
        ESP_LOGE(TAG, "Cannot create reinit_mutex");
        goto init_failed;
    }

    const configSTACK_DEPTH_TYPE stack_depth = 6000;
    xTaskCreate(astarte_device_reinit_task, "astarte_device_reinit_task", stack_depth, ret,
        tskIDLE_PRIORITY, &ret->reinit_task_handle);
    if (!ret->reinit_task_handle) {
        ESP_LOGE(TAG, "Cannot start astarte_device_reinit_task");
        goto init_failed;
    }

    const char *encoded_hwid = NULL;
    if (cfg->hwid) {
        encoded_hwid = cfg->hwid;
    } else {
        uint8_t generated_hwid[HWID_LENGTH];
        astarte_err_t hwid_err = astarte_hwid_get_id(generated_hwid);
        if (hwid_err != ASTARTE_OK) {
            ESP_LOGE(TAG, "Cannot get device HWID: %d", hwid_err);
            goto init_failed;
        }
        char generated_encoded_hwid[ENCODED_HWID_LENGTH];
        hwid_err = astarte_hwid_encode(generated_encoded_hwid, ENCODED_HWID_LENGTH, generated_hwid);
        if (hwid_err != ASTARTE_OK) {
            ESP_LOGE(TAG, "Cannot encode device HWID: %d", hwid_err);
            goto init_failed;
        }
        encoded_hwid = generated_encoded_hwid;
    }

    ESP_LOGD(TAG, "hwid is: %s", encoded_hwid);

    if (cfg->credentials_secret) {
        ret->credentials_secret = strdup(cfg->credentials_secret);
    }

    const char *realm = NULL;
    if (cfg->realm) {
        realm = cfg->realm;
    } else {
        realm = CONFIG_ASTARTE_REALM;
    }

    astarte_err_t res = astarte_device_init_connection(ret, encoded_hwid, realm);
    if (res != ASTARTE_OK) {
        ESP_LOGE(TAG, "Cannot init Astarte device: %d", res);
        goto init_failed;
    }

    ret->encoded_hwid = strdup(encoded_hwid);
    if (!ret->encoded_hwid) {
        ESP_LOGE(TAG, "Out of memory %s: %d", __FILE__, __LINE__);
        goto init_failed;
    }

    ret->realm = strdup(realm);
    if (!ret->realm) {
        ESP_LOGE(TAG, "Out of memory %s: %d", __FILE__, __LINE__);
        goto init_failed;
    }

    astarte_list_init(&ret->interfaces_list);
    ret->data_event_callback = cfg->data_event_callback;
    ret->unset_event_callback = cfg->unset_event_callback;
    ret->connection_event_callback = cfg->connection_event_callback;
    ret->disconnection_event_callback = cfg->disconnection_event_callback;
    ret->callbacks_user_data = cfg->callbacks_user_data;

    return ret;

