sorru94/astarte-device-sdk-esp32/src/astarte_device.c
    char broker_url[URL_LENGTH];
    err = astarte_pairing_get_mqtt_v1_broker_url(&pairing_config, broker_url, URL_LENGTH);
    if (err != ASTARTE_OK) {
        ESP_LOGE(TAG, "Error in get_mqtt_v1_broker_url");
        goto init_failed;
    } else {
        ESP_LOGD(TAG, "Broker URL is: %s", broker_url);
    }

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
    const esp_mqtt_client_config_t mqtt_cfg
        = {.broker.address.uri = broker_url,
#if CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
              .broker.verification.crt_bundle_attach = esp_crt_bundle_attach,
#endif
              .credentials.authentication.certificate = client_cert_pem,
              .credentials.authentication.key = key_pem,
          };
#else
    const esp_mqtt_client_config_t mqtt_cfg
        = {.uri = broker_url,
#if CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
              .crt_bundle_attach = esp_crt_bundle_attach,
#endif
              .client_cert_pem = client_cert_pem,
              .client_key_pem = key_pem,
              .user_context = device,
              // TODO: At this time, the device starts with a clean session every connection,
              //  to change this behavior, it is necessary to enable disable_clean_session.
              //  Before enable it pay attention if the #issue-29 has been solved
              //  (see: https://github.com/astarte-platform/astarte-device-sdk-esp32/issues/29).
              //  .disable_clean_session = true,
          };
#endif

    esp_mqtt_client_handle_t mqtt_client = esp_mqtt_client_init(&mqtt_cfg);
    if (!mqtt_client) {
        ESP_LOGE(TAG, "Error in esp_mqtt_client_init");
        goto init_failed;
    }

    esp_mqtt_client_register_event(mqtt_client, ESP_EVENT_ANY_ID, mqtt_event_handler, device);

    device->mqtt_client = mqtt_client;
    device->device_topic = client_cert_cn;
    device->device_topic_len = strlen(client_cert_cn);
    device->client_cert_pem = client_cert_pem;
    device->key_pem = key_pem;

    return ASTARTE_OK;

init_failed:
    free(key_pem);
    free(client_cert_pem);
    free(client_cert_cn);

    return err;
}

void astarte_device_destroy(astarte_device_handle_t device)
{
    if (!device) {
        return;
    }

    // Avoid destroying a device that is being reinitialized
    xSemaphoreTake(device->reinit_mutex, portMAX_DELAY);

    esp_mqtt_client_destroy(device->mqtt_client);
    xTaskNotify(device->reinit_task_handle, NOTIFY_TERMINATE, eSetBits);
    vSemaphoreDelete(device->reinit_mutex);
    free(device->device_topic);
    free(device->client_cert_pem);
    free(device->key_pem);
    free(device->encoded_hwid);
    free(device->credentials_secret);
    free(device->realm);
    astarte_list_head_t *item = NULL;
    astarte_list_head_t *tmp = NULL;
    MUTABLE_LIST_FOR_EACH(item, tmp, &device->interfaces_list)
    {
        astarte_ptr_list_entry_t *entry = GET_LIST_ENTRY(item, astarte_ptr_list_entry_t, head);
        free(entry);
    }
    free(device);
}

astarte_err_t astarte_device_add_interface(
    astarte_device_handle_t device, const astarte_interface_t *interface)
{
    if (xSemaphoreTake(device->reinit_mutex, (TickType_t) 10) == pdFALSE) {
        ESP_LOGE(TAG, "Trying to add an interface to a device that is being reinitialized");
        return ASTARTE_ERR;
    }

    if (interface->major_version == 0 && interface->minor_version == 0) {
        ESP_LOGE(TAG, "Trying to add an interface with both major and minor version equal 0");
        return ASTARTE_ERR_INVALID_INTERFACE_VERSION;
    }

    astarte_ptr_list_entry_t *entry = calloc(1, sizeof(astarte_ptr_list_entry_t));
    if (!entry) {
        ESP_LOGE(TAG, "Out of memory %s: %d", __FILE__, __LINE__);
        xSemaphoreGive(device->reinit_mutex);
        return ASTARTE_ERR_OUT_OF_MEMORY;
    }

    entry->value = interface;

    astarte_list_append(&device->interfaces_list, &entry->head);

    xSemaphoreGive(device->reinit_mutex);
    return ASTARTE_OK;
}

astarte_err_t astarte_device_start(astarte_device_handle_t device)
{
    if (xSemaphoreTake(device->reinit_mutex, (TickType_t) 10) == pdFALSE) {
        ESP_LOGE(TAG, "Trying to start device that is being reinitialized");
        return ASTARTE_ERR_DEVICE_NOT_READY;
    }

    astarte_err_t ret = ASTARTE_OK;

    esp_err_t err = esp_mqtt_client_start(device->mqtt_client);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to start MQTT client: %s", esp_err_to_name(err));
        ret = ASTARTE_ERR;
    }

    xSemaphoreGive(device->reinit_mutex);

    return ret;
}

astarte_err_t astarte_device_stop(astarte_device_handle_t device)
{
    if (xSemaphoreTake(device->reinit_mutex, (TickType_t) 10) == pdFALSE) {
        ESP_LOGE(TAG, "Trying to stop device that is being reinitialized");
        return ASTARTE_ERR_DEVICE_NOT_READY;
    }

    astarte_err_t ret = ASTARTE_OK;

    esp_err_t err = esp_mqtt_client_stop(device->mqtt_client);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to stop MQTT client: %s", esp_err_to_name(err));
        ret = ASTARTE_ERR;
    }

    xSemaphoreGive(device->reinit_mutex);

    if (ret == ASTARTE_OK) {
        // If we succesfully disconnected, call on_disconnected since
        // MQTT_EVENT_DISCONNECTED is not triggered for manual disconnections
        on_disconnected(device);
    }

    return ret;
}

static astarte_err_t publish_bson(astarte_device_handle_t device, const char *interface_name,
    const char *path, astarte_bson_serializer_handle_t bson, int qos)
{
    int len = 0;
    const void *data = astarte_bson_serializer_get_document(bson, &len);
    if (!data) {
        ESP_LOGE(TAG, "Error during BSON serialization");
        return ASTARTE_ERR;
    }
    if (len < 0) {
        ESP_LOGE(TAG, "BSON document is too long for MQTT publish.");
        ESP_LOGE(TAG, "Interface: %s, path: %s", interface_name, path);
        return ASTARTE_ERR;
    }

    if (interface_is_property(device, interface_name)) {
        // Open storage
        astarte_storage_handle_t storage_handle;
        astarte_storage_err_t storage_err = astarte_storage_open(&storage_handle);
        if (storage_err != ASTARTE_STORAGE_ERR_OK) {
            ESP_LOGE(TAG, "Error opening storage.");
            return ASTARTE_ERR;
        }
        // Check if property is already stored in nvs with same value
        bool is_contained = false;
        storage_err = astarte_storage_contains_property(
            storage_handle, interface_name, path, data, len, &is_contained);
        if (storage_err != ASTARTE_STORAGE_ERR_OK) {
            ESP_LOGE(TAG, "Error checking if property is in storage.");
            return ASTARTE_ERR;
        }
        if (is_contained) {
            ESP_LOGW(
                TAG, "Trying to set a property twice, interface %s, path %s", interface_name, path);
            return ASTARTE_OK;
        }
        // Store property
        storage_err
            = astarte_storage_store_property(storage_handle, interface_name, path, data, len);
        if (storage_err != ASTARTE_STORAGE_ERR_OK) {
            ESP_LOGE(TAG, "Error storing property.");
            return ASTARTE_ERR;
        }
        // Close storage
        astarte_storage_close(storage_handle);
    }

    return publish_data(device, interface_name, path, data, len, qos);
}

static astarte_err_t publish_data(astarte_device_handle_t device, const char *interface_name,
    const char *path, const void *data, int length, int qos)
{
    if (path[0] != '/') {
        ESP_LOGE(TAG, "Invalid path: %s (must be start with /)", path);
        return ASTARTE_ERR_INVALID_INTERFACE_PATH;
    }

    if (qos < 0 || qos > 2) {
        ESP_LOGE(TAG, "Invalid QoS: %d (must be 0, 1 or 2)", qos);
        return ASTARTE_ERR_INVALID_QOS;
    }

    char topic[TOPIC_LENGTH];
    int print_ret
        = snprintf(topic, TOPIC_LENGTH, "%s/%s%s", device->device_topic, interface_name, path);
    if ((print_ret < 0) || (print_ret >= TOPIC_LENGTH)) {
        ESP_LOGE(TAG, "Error encoding topic");
        return ASTARTE_ERR;
    }

    if (xSemaphoreTake(device->reinit_mutex, (TickType_t) 10) == pdFALSE) {
        ESP_LOGE(TAG, "Trying to publish to a device that is being reinitialized");
        return ASTARTE_ERR_DEVICE_NOT_READY;
    }

    esp_mqtt_client_handle_t mqtt = device->mqtt_client;

    ESP_LOGD(TAG, "Publishing on %s with QoS %d", topic, qos);
    int ret = esp_mqtt_client_publish(mqtt, topic, data, length, qos, 0);
    xSemaphoreGive(device->reinit_mutex);
    if (ret < 0) {
        ESP_LOGE(TAG, "Publish on %s failed", topic);
        return ASTARTE_ERR_PUBLISH;
    }

    ESP_LOGD(TAG, "Publish succeeded, msg_id: %d", ret);
    return ASTARTE_OK;
}

static void maybe_append_timestamp(astarte_bson_serializer_handle_t bson, uint64_t ts_epoch_millis)
{
    if (ts_epoch_millis != ASTARTE_INVALID_TIMESTAMP) {
        astarte_bson_serializer_append_datetime(bson, "t", ts_epoch_millis);
    }
}

astarte_err_t astarte_device_stream_double_with_timestamp(astarte_device_handle_t device,
    const char *interface_name, const char *path, double value, uint64_t ts_epoch_millis, int qos)
{
    astarte_bson_serializer_handle_t bson = astarte_bson_serializer_new();
    astarte_bson_serializer_append_double(bson, "v", value);
    maybe_append_timestamp(bson, ts_epoch_millis);
    astarte_bson_serializer_append_end_of_document(bson);

    astarte_err_t exit_code = publish_bson(device, interface_name, path, bson, qos);

    astarte_bson_serializer_destroy(bson);
    return exit_code;
}

