sorru94/astarte-device-sdk-esp32/src/astarte_device.c
astarte_err_t astarte_device_stream_integer_with_timestamp(astarte_device_handle_t device,
    const char *interface_name, const char *path, int32_t value, uint64_t ts_epoch_millis, int qos)
{
    astarte_bson_serializer_handle_t bson = astarte_bson_serializer_new();
    astarte_bson_serializer_append_int32(bson, "v", value);
    maybe_append_timestamp(bson, ts_epoch_millis);
    astarte_bson_serializer_append_end_of_document(bson);

    astarte_err_t exit_code = publish_bson(device, interface_name, path, bson, qos);

    astarte_bson_serializer_destroy(bson);
    return exit_code;
}

astarte_err_t astarte_device_stream_longinteger_with_timestamp(astarte_device_handle_t device,
    const char *interface_name, const char *path, int64_t value, uint64_t ts_epoch_millis, int qos)
{
    astarte_bson_serializer_handle_t bson = astarte_bson_serializer_new();
    astarte_bson_serializer_append_int64(bson, "v", value);
    maybe_append_timestamp(bson, ts_epoch_millis);
    astarte_bson_serializer_append_end_of_document(bson);

    astarte_err_t exit_code = publish_bson(device, interface_name, path, bson, qos);

    astarte_bson_serializer_destroy(bson);
    return exit_code;
}

astarte_err_t astarte_device_stream_boolean_with_timestamp(astarte_device_handle_t device,
    const char *interface_name, const char *path, bool value, uint64_t ts_epoch_millis, int qos)
{
    astarte_bson_serializer_handle_t bson = astarte_bson_serializer_new();
    astarte_bson_serializer_append_boolean(bson, "v", value);
    maybe_append_timestamp(bson, ts_epoch_millis);
    astarte_bson_serializer_append_end_of_document(bson);

    astarte_err_t exit_code = publish_bson(device, interface_name, path, bson, qos);

    astarte_bson_serializer_destroy(bson);
    return exit_code;
}

astarte_err_t astarte_device_stream_string_with_timestamp(astarte_device_handle_t device,
    const char *interface_name, const char *path, const char *value, uint64_t ts_epoch_millis,
    int qos)
{
    astarte_bson_serializer_handle_t bson = astarte_bson_serializer_new();
    astarte_bson_serializer_append_string(bson, "v", value);
    maybe_append_timestamp(bson, ts_epoch_millis);
    astarte_bson_serializer_append_end_of_document(bson);

    astarte_err_t exit_code = publish_bson(device, interface_name, path, bson, qos);

    astarte_bson_serializer_destroy(bson);
    return exit_code;
}

astarte_err_t astarte_device_stream_binaryblob_with_timestamp(astarte_device_handle_t device,
    const char *interface_name, const char *path, void *value, size_t size,
    uint64_t ts_epoch_millis, int qos)
{
    astarte_bson_serializer_handle_t bson = astarte_bson_serializer_new();
    astarte_bson_serializer_append_binary(bson, "v", value, size);
    maybe_append_timestamp(bson, ts_epoch_millis);
    astarte_bson_serializer_append_end_of_document(bson);

    astarte_err_t exit_code = publish_bson(device, interface_name, path, bson, qos);

    astarte_bson_serializer_destroy(bson);
    return exit_code;
}

astarte_err_t astarte_device_stream_datetime_with_timestamp(astarte_device_handle_t device,
    const char *interface_name, const char *path, int64_t value, uint64_t ts_epoch_millis, int qos)
{
    astarte_bson_serializer_handle_t bson = astarte_bson_serializer_new();
    astarte_bson_serializer_append_datetime(bson, "v", value);
    maybe_append_timestamp(bson, ts_epoch_millis);
    astarte_bson_serializer_append_end_of_document(bson);

    astarte_err_t exit_code = publish_bson(device, interface_name, path, bson, qos);

    astarte_bson_serializer_destroy(bson);
    return exit_code;
}

#define IMPL_ASTARTE_DEVICE_STREAM_ARRAY_T_WITH_TIMESTAMP(TYPE, TYPE_NAME, BSON_TYPE_NAME)         \
    astarte_err_t astarte_device_stream_##TYPE_NAME##_with_timestamp(                              \
        astarte_device_handle_t device, const char *interface_name, const char *path, TYPE value,  \
        int count, uint64_t ts_epoch_millis, int qos)                                              \
    {                                                                                              \
        astarte_bson_serializer_handle_t bson = astarte_bson_serializer_new();                     \
        astarte_bson_serializer_append_##BSON_TYPE_NAME(bson, "v", value, count);                  \
        maybe_append_timestamp(bson, ts_epoch_millis);                                             \
        astarte_bson_serializer_append_end_of_document(bson);                                      \
                                                                                                   \
        astarte_err_t exit_code = publish_bson(device, interface_name, path, bson, qos);           \
                                                                                                   \
        astarte_bson_serializer_destroy(bson);                                                     \
        return exit_code;                                                                          \
    }

IMPL_ASTARTE_DEVICE_STREAM_ARRAY_T_WITH_TIMESTAMP(const double *, double_array, double_array)
IMPL_ASTARTE_DEVICE_STREAM_ARRAY_T_WITH_TIMESTAMP(const int32_t *, integer_array, int32_array)
IMPL_ASTARTE_DEVICE_STREAM_ARRAY_T_WITH_TIMESTAMP(const int64_t *, longinteger_array, int64_array)
IMPL_ASTARTE_DEVICE_STREAM_ARRAY_T_WITH_TIMESTAMP(const bool *, boolean_array, boolean_array)
IMPL_ASTARTE_DEVICE_STREAM_ARRAY_T_WITH_TIMESTAMP(const char *const *, string_array, string_array)
IMPL_ASTARTE_DEVICE_STREAM_ARRAY_T_WITH_TIMESTAMP(const int64_t *, datetime_array, datetime_array)

astarte_err_t astarte_device_stream_binaryblob_array_with_timestamp(astarte_device_handle_t device,
    const char *interface_name, const char *path, const void *const *values, const int *sizes,
    int count, uint64_t ts_epoch_millis, int qos)
{
    astarte_bson_serializer_handle_t bson = astarte_bson_serializer_new();
    astarte_err_t exit_code
        = astarte_bson_serializer_append_binary_array(bson, "v", values, sizes, count);
    maybe_append_timestamp(bson, ts_epoch_millis);
    astarte_bson_serializer_append_end_of_document(bson);

    if (exit_code == ASTARTE_OK) {
        exit_code = publish_bson(device, interface_name, path, bson, qos);
    }

    astarte_bson_serializer_destroy(bson);
    return exit_code;
}

