sorru94/astarte-device-sdk-esp32/src/astarte_device.c
exit:
    free(csr);
    free(cert_pem);
    return ret;
}

static astarte_err_t check_device(astarte_device_handle_t device)
{
    if (!device->mqtt_client) {
        ESP_LOGE(TAG, "NULL mqtt_client");
        return ASTARTE_ERR;
    }

    if (!device->device_topic) {
        ESP_LOGE(TAG, "NULL device_topic");
        return ASTARTE_ERR;
    }

    return ASTARTE_OK;
}

static size_t get_int_string_size(int number)
{
    size_t digits = 1;
    const int max_number_in_single_digit = 9;
    const int min_number_in_double_digit = 10;
    while (number > max_number_in_single_digit) {
        number /= min_number_in_double_digit;
        digits++;
    }
    return digits;
}

static size_t get_introspection_string_size(astarte_device_handle_t device)
{
    astarte_list_head_t *item = NULL;
    size_t introspection_size = 0;
    LIST_FOR_EACH(item, &device->interfaces_list)
    {
        astarte_ptr_list_entry_t *entry = GET_LIST_ENTRY(item, astarte_ptr_list_entry_t, head);
        const astarte_interface_t *interface = entry->value;

        size_t major_digits = get_int_string_size(interface->major_version);
        size_t minor_digits = get_int_string_size(interface->minor_version);

        // The interface name in introspection is composed as  "name:major:minor;"
        introspection_size += strlen(interface->name) + major_digits + minor_digits + 3;
    }
    return introspection_size;
}

static void send_introspection(astarte_device_handle_t device)
{
    if (check_device(device) != ASTARTE_OK) {
        return;
    }

    esp_mqtt_client_handle_t mqtt = device->mqtt_client;

    astarte_list_head_t *item = NULL;
    size_t introspection_size = get_introspection_string_size(device);

    // if introspection size is > 4KiB print a warning
    const size_t max_introspection_size = 4096;
    if (introspection_size > max_introspection_size) {
        ESP_LOGW(TAG, "The introspection size is > 4KiB");
    }

    char *introspection_string = calloc(introspection_size + 1, sizeof(char));
    if (!introspection_string) {
        ESP_LOGE(TAG, "Unable to allocate memory for introspection string");
        return;
    }
    int len = 0;
    LIST_FOR_EACH(item, &device->interfaces_list)
    {
        astarte_ptr_list_entry_t *entry = GET_LIST_ENTRY(item, astarte_ptr_list_entry_t, head);
        const astarte_interface_t *interface = entry->value;
        len += sprintf(introspection_string + len, "%s:%d:%d;", interface->name,
            interface->major_version, interface->minor_version);
    }
    // Remove last ; from introspection
    introspection_string[len - 1] = 0;
    // Decrease len accordingly
    len -= 1;

    ESP_LOGD(TAG, "Publishing introspection: %s", introspection_string);
    esp_mqtt_client_publish(mqtt, device->device_topic, introspection_string, len, 2, 0);
    free(introspection_string);
}

static void setup_subscriptions(astarte_device_handle_t device)
{
    if (check_device(device) != ASTARTE_OK) {
        return;
    }

    char topic[TOPIC_LENGTH];

    esp_mqtt_client_handle_t mqtt = device->mqtt_client;

    // Subscribe to control messages
    int ret = snprintf(topic, TOPIC_LENGTH, "%s/control/consumer/properties", device->device_topic);
    if ((ret < 0) || (ret >= TOPIC_LENGTH)) {
        ESP_LOGE(TAG, "Error encoding topic");
        return;
    }

    ESP_LOGD(TAG, "Subscribing to %s", topic);
    esp_mqtt_client_subscribe(mqtt, topic, 2);

    astarte_list_head_t *item = NULL;
    LIST_FOR_EACH(item, &device->interfaces_list)
    {
        astarte_ptr_list_entry_t *entry = GET_LIST_ENTRY(item, astarte_ptr_list_entry_t, head);
        const astarte_interface_t *interface = entry->value;
        if (interface->ownership == OWNERSHIP_SERVER) {
            // Subscribe to server interface subtopics
            ret = snprintf(topic, TOPIC_LENGTH, "%s/%s/#", device->device_topic, interface->name);
            if ((ret < 0) || (ret >= TOPIC_LENGTH)) {
                ESP_LOGE(TAG, "Error encoding topic");
                continue;
            }
            ESP_LOGD(TAG, "Subscribing to %s", topic);
            esp_mqtt_client_subscribe(mqtt, topic, 2);
        }
    }
}

static void send_emptycache(astarte_device_handle_t device)
{
    if (check_device(device) != ASTARTE_OK) {
        return;
    }

    esp_mqtt_client_handle_t mqtt = device->mqtt_client;

    char topic[TOPIC_LENGTH];
    int ret = snprintf(topic, TOPIC_LENGTH, "%s/control/emptyCache", device->device_topic);
    if ((ret < 0) || (ret >= TOPIC_LENGTH)) {
        ESP_LOGE(TAG, "Error encoding topic");
        return;
    }
    ESP_LOGD(TAG, "Sending emptyCache to %s", topic);
    esp_mqtt_client_publish(mqtt, topic, "1", 1, 2, 0);
}

static void send_device_owned_properties(astarte_device_handle_t device)
{
    if (check_device(device) != ASTARTE_OK) {
        return;
    }

    char *interface_name = NULL;
    char *path = NULL;
    uint8_t *value = NULL;

    astarte_set_handle_t set_handle = astarte_set_init();

    // Open storage
    astarte_storage_handle_t storage_handle;
    astarte_storage_err_t storage_err = astarte_storage_open(&storage_handle);
    if (storage_err != ASTARTE_STORAGE_ERR_OK) {
        ESP_LOGE(TAG, "Error opening storage %d.", storage_err);
        goto end;
    }

    // Create iterator
    astarte_storage_iterator_t storage_iterator;
    storage_err = astarte_storage_iterator_create(storage_handle, &storage_iterator);
    if ((storage_err != ASTARTE_STORAGE_ERR_OK) && (storage_err != ASTARTE_STORAGE_ERR_NOT_FOUND)) {
        ESP_LOGE(TAG, "Error creating the properties iterator %d.", storage_err);
        astarte_storage_close(storage_handle);
        goto end;
    }

    while (storage_err == ASTARTE_STORAGE_ERR_OK) {
        // Fetch property len
        size_t interface_name_len = 0;
        size_t path_len = 0;
        size_t value_len = 0;
        storage_err = astarte_storage_iterator_get_property(
            &storage_iterator, NULL, &interface_name_len, NULL, &path_len, NULL, &value_len);
        if (storage_err != ASTARTE_STORAGE_ERR_OK) {
            ESP_LOGE(TAG, "Error preparing to get one of the properties %d.", storage_err);
            astarte_storage_close(storage_handle);
            goto end;
        }
        // Allocate memory for property data
        interface_name = calloc(interface_name_len, sizeof(char));
        path = calloc(path_len, sizeof(char));
        value = calloc(value_len, sizeof(uint8_t));
        if ((interface_name == NULL) || (path == NULL) || (value == NULL)) {
            ESP_LOGE(TAG, "Out of memory %s: %d", __FILE__, __LINE__);
            astarte_storage_close(storage_handle);
            goto end;
        }
        // Fetch property content
        storage_err = astarte_storage_iterator_get_property(&storage_iterator, interface_name,
            &interface_name_len, path, &path_len, value, &value_len);
        if (storage_err != ASTARTE_STORAGE_ERR_OK) {
            ESP_LOGE(TAG, "Error getting one of the properties %d.", storage_err);
            astarte_storage_close(storage_handle);
            goto end;
        }

        bool advance_iterator = true;
        // If property is not in introspection anymore, delete it from storage
        if (!interface_is_in_introspection(device, interface_name)) {
            // Check if this is the last iterable item
            bool has_next = false;
            storage_err = astarte_storage_iterator_peak(&storage_iterator, &has_next);
            if (storage_err != ASTARTE_STORAGE_ERR_OK) {
                ESP_LOGE(TAG, "Error peaking next property: %d.", storage_err);
                astarte_storage_close(storage_handle);
                goto end;
            }
            // Delete the property
            storage_err = astarte_storage_delete_property(storage_handle, interface_name, path);
            if (storage_err != ASTARTE_STORAGE_ERR_OK) {
                ESP_LOGE(TAG, "Error deleting the property  %d.", storage_err);
                astarte_storage_close(storage_handle);
                goto end;
            }
            // If the deleted iterm was the last one, break the loop here
            if (!has_next) {
                break;
            }
            // Prevent the iterator from advancing
            advance_iterator = false;
        }
        // If property is device owned send it to Astarte
        else if (interface_is_device_owned(device, interface_name)) {
            // Assuming that since the property is present in storage the size of the value
            // has already been checked and does not exceed the max value for an integer.
            publish_data(device, interface_name, path, value, (int) value_len, 2);

            // Get the combined interface_name and path for the property
            size_t property_full_path_len = interface_name_len + path_len - 1;
            char *property_full_path = calloc(property_full_path_len, sizeof(char));
            strncat(strncpy(property_full_path, interface_name, interface_name_len), path,
                path_len - 1);

