sorru94/astarte-device-sdk-esp32/src/astarte_device.c
            // Store the property full path in a temporary set
            astarte_set_element_t set_element
                = { .value = property_full_path, .value_len = property_full_path_len };
            astarte_err_t set_err = astarte_set_add(&set_handle, set_element);
            if (set_err != ASTARTE_OK) {
                ESP_LOGE(TAG, "Error adding a property name to the set.");
                goto end;
            }
        }
        // Free memory of property data
        free(interface_name);
        interface_name = NULL;
        free(path);
        path = NULL;
        free(value);
        value = NULL;
        // Advance the iterator if required
        if (advance_iterator) {
            storage_err = astarte_storage_iterator_advance(&storage_iterator);
            if (storage_err != ASTARTE_STORAGE_ERR_OK) {
                if (storage_err != ASTARTE_STORAGE_ERR_NOT_FOUND) {
                    ESP_LOGE(TAG, "Error advancing properties iterator %d.", storage_err);
                }
                break;
            }
        }
    }

    // Close astarte storage
    astarte_storage_close(storage_handle);

    // Send purge device properties
    send_purge_device_properties(device, &set_handle);

end:
    // Destroy the set
    astarte_set_destroy_and_release(&set_handle);

    // Free all data
    free(interface_name);
    free(path);
    free(value);
}

static void send_purge_device_properties(
    astarte_device_handle_t device, astarte_set_handle_t *set_handle)
{
    // Pointer to string that will contain a list of interface names separated by the ';' char
    char *properties_list = NULL;
    // Size of the string contained in properties_list including the '\0' terminating char
    size_t properties_list_len = 0;

    char *payload = NULL;
    size_t payload_len = 0;

    while (!astarte_set_is_empty(set_handle)) {
        // Get a property path from the set
        astarte_set_element_t property_path;
        astarte_set_pop(set_handle, &property_path); // Ignore return value as it is always ok

        // Append interface name to the ';' separated string
        // Both lengths include a +1 for the '\0' char
        // We do a simple sum since we need an extra char to store the ';'
        size_t ext_properties_list_len = properties_list_len + property_path.value_len;
        char *ext_properties_list = (char *) realloc(properties_list, ext_properties_list_len);
        if (ext_properties_list == NULL) {
            ESP_LOGE(TAG, "Out of memory %s: %d", __FILE__, __LINE__);
            free(property_path.value);
            // Deallocate everything from the set
            while (!astarte_set_is_empty(set_handle)) {
                astarte_set_pop(set_handle, &property_path); // Ignore return value, it is always ok
                free(property_path.value);
            }
            goto end;
        }
        if (properties_list_len == 0) {
            // Set the first char to '\0' for the first interface name
            *ext_properties_list = '\0';
        } else {
            // Append a ';' for any subsequent interface name
            strcat(ext_properties_list, ";");
        }
        // Append the new interface name
        properties_list = strcat(ext_properties_list, property_path.value);
        properties_list_len = ext_properties_list_len;

        free(property_path.value);
    }

    // Step 1 estimate compression result size and payload size
    size_t compression_input_len = (properties_list) ? (properties_list_len - 1) : 0;
    uLongf compressed_len = compressBound(compression_input_len);
    // Step 2 allocate enough memory for the payload
    payload_len = 4 + compressed_len;
    payload = calloc(payload_len, sizeof(char));
    if (payload == NULL) {
        ESP_LOGE(TAG, "Out of memory %s: %d", __FILE__, __LINE__);
        goto end;
    }
    // Fill the first 32 bits of the payload
    uint32_t *payload_uint32 = (uint32_t *) payload;
    *payload_uint32 = __builtin_bswap32(compression_input_len);
    // Perform the compression and store result in the payload
    int compress_res = astarte_zlib_compress((char unsigned *) &payload[4], &compressed_len,
        (char unsigned *) properties_list, compression_input_len);
    if (compress_res != Z_OK) {
        ESP_LOGE(TAG, "Compression error %d.", compress_res);
        goto end;
    }
    // 'astarte_zlib_compress' updates 'compressed_len' to the actual size of the compressed data
    payload_len = 4 + compressed_len;
    // Check if payload is not too large for a MQTT message
    if (payload_len > INT_MAX) {
        // MQTT supports sending a maximum payload length of INT_MAX
        ESP_LOGE(TAG, "Purge properties payload is too long for a single MQTT message.");
        goto end;
    }

    // Compose MQTT topic
    char topic[TOPIC_LENGTH];
    int ret = snprintf(topic, TOPIC_LENGTH, "%s/control/producer/properties", device->device_topic);
    if ((ret < 0) || (ret >= TOPIC_LENGTH)) {
        ESP_LOGE(TAG, "Error encoding topic");
        goto end;
    }
    // Set constant for MQTT QoS
    const int qos = 2;
    // Publish MQTT message
    ESP_LOGD(TAG, "Sending purge properties to: '%s', with uncompressed content: '%s'", topic,
        (properties_list) ? properties_list : "");
    esp_mqtt_client_publish(device->mqtt_client, topic, payload, (int) payload_len, qos, 0);

end:
    free(properties_list);
    free(payload);
}

static void on_connected(astarte_device_handle_t device, int session_present)
{
    device->connected = true;

    if (device->connection_event_callback) {
        astarte_device_connection_event_t event = {
            .device = device,
            .session_present = session_present,
            .user_data = device->callbacks_user_data,
        };

        device->connection_event_callback(&event);
    }

    if (session_present) {
        return;
    }

    setup_subscriptions(device);
    send_introspection(device);
    send_emptycache(device);
    send_device_owned_properties(device);
}

static void on_disconnected(astarte_device_handle_t device)
{
    device->connected = false;

    if (device->disconnection_event_callback) {
        astarte_device_disconnection_event_t event = {
            .device = device,
            .user_data = device->callbacks_user_data,
        };

