sorru94/astarte-device-sdk-esp32/src/astarte_device.c
        device->disconnection_event_callback(&event);
    }
}

static void on_incoming(
    astarte_device_handle_t device, char *topic, int topic_len, char *data, int data_len)
{
    if (check_device(device) != ASTARTE_OK) {
        return;
    }

    if (!device->data_event_callback) {
        ESP_LOGE(TAG, "data_event_callback not set");
        return;
    }

    if (strstr(topic, device->device_topic) != topic) {
        ESP_LOGE(TAG, "Incoming message topic doesn't begin with device_topic: %s", topic);
        return;
    }

    const size_t maximum_control_prefix_len = 512;
    char control_prefix[maximum_control_prefix_len];
    int ret
        = snprintf(control_prefix, maximum_control_prefix_len, "%s/control", device->device_topic);
    if ((ret < 0) || (ret >= maximum_control_prefix_len)) {
        ESP_LOGE(TAG, "Error encoding control prefix");
        return;
    }

    // Control message
    size_t control_prefix_len = strlen(control_prefix);
    if (strstr(topic, control_prefix)) {
        char *control_topic = topic + control_prefix_len;
        ESP_LOGD(TAG, "Received control message on control topic %s", control_topic);
        on_control_message(device, control_topic, data, data_len);
        return;
    }

    // Data message
    if (topic_len < device->device_topic_len + strlen("/")
        || topic[device->device_topic_len] != '/') {
        ESP_LOGE(TAG, "No / after device_topic, can't find interface: %s", topic);
        return;
    }

    char *interface_name_begin = topic + device->device_topic_len + strlen("/");
    char *path_begin = strchr(interface_name_begin, '/');
    if (!path_begin) {
        ESP_LOGE(TAG, "No / after interface_name, can't find path: %s", topic);
        return;
    }

    int interface_name_len = path_begin - interface_name_begin;
    const size_t maximum_interface_name_len = 512;
    char interface_name[maximum_interface_name_len];
    ret = snprintf(interface_name, maximum_interface_name_len, "%.*s", interface_name_len,
        interface_name_begin);
    if ((ret < 0) || (ret >= maximum_interface_name_len)) {
        ESP_LOGE(TAG, "Error encoding interface name");
        return;
    }

    size_t path_len = topic_len - device->device_topic_len - strlen("/") - interface_name_len;
    const size_t maximum_path_len = 512;
    char path[maximum_path_len];
    ret = snprintf(path, maximum_path_len, "%.*s", path_len, path_begin);
    if ((ret < 0) || (ret >= maximum_path_len)) {
        ESP_LOGE(TAG, "Error encoding path");
        return;
    }

    if (!data && data_len == 0) {
        if (device->unset_event_callback) {
            astarte_device_unset_event_t event = {
                .device = device,
                .interface_name = interface_name,
                .path = path,
                .user_data = device->callbacks_user_data,
            };
            device->unset_event_callback(&event);
        } else {
            ESP_LOGE(
                TAG, "Unset data for %s received, but unset_event_callback is not defined", path);
        }
        return;
    }

    if (!astarte_bson_deserializer_check_validity(data, data_len)) {
        ESP_LOGE(TAG, "Invalid BSON document in data");
        return;
    }

    if (interface_is_property(device, interface_name)) {
        // Open storage
        astarte_storage_handle_t storage_handle;
        astarte_storage_err_t storage_err = astarte_storage_open(&storage_handle);
        if (storage_err != ASTARTE_STORAGE_ERR_OK) {
            ESP_LOGE(TAG, "Error opening storage.");
            return;
        }
        // Check if property is already stored in nvs with same value
        bool is_contained = false;
        if (astarte_storage_contains_property(
                storage_handle, interface_name, path, data, data_len, &is_contained)
            != ASTARTE_STORAGE_ERR_OK) {
            ESP_LOGE(TAG, "Error checking if received property is in storage.");
            return;
        }
        if (is_contained) {
            ESP_LOGD(TAG, "Trying to set a received property already set with the same value.");
            return;
        }

        // Store property
        storage_err
            = astarte_storage_store_property(storage_handle, interface_name, path, data, data_len);
        if (storage_err != ASTARTE_STORAGE_ERR_OK) {
            ESP_LOGE(TAG, "Error storing received property.");
            return;
        }
        // Close storage
        astarte_storage_close(storage_handle);
    }

    // Keep old deserializer for compatibility
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wdeprecated-declarations"
    uint8_t bson_value_type = 0U;
    const void *bson_value = astarte_bson_key_lookup("v", data, &bson_value_type);
    if (!bson_value) {
        ESP_LOGE(TAG, "Cannot retrieve BSON value from data");
        return;
    }
#pragma GCC diagnostic pop

    // Use new deserializer
    astarte_bson_document_t full_document = astarte_bson_deserializer_init_doc(data);
    astarte_bson_element_t v_elem;
    if (astarte_bson_deserializer_element_lookup(full_document, "v", &v_elem) != ASTARTE_OK) {
        ESP_LOGE(TAG, "Cannot retrieve BSON value from data");
        return;
    }

    astarte_device_data_event_t event = {
        .device = device,
        .interface_name = interface_name,
        .path = path,
        .bson_value = bson_value,
        .bson_value_type = bson_value_type,
        .bson_element = v_elem,
        .user_data = device->callbacks_user_data,
    };

    device->data_event_callback(&event);
}

static void on_control_message(
    astarte_device_handle_t device, char *control_topic, char *data, int data_len)
{
    if (strcmp(control_topic, "/consumer/properties") == 0) {
        on_purge_properties(device, data, data_len);
    } else {
        ESP_LOGE(TAG, "Received unrecognized control message: %s.", control_topic);
    }
}

static void on_purge_properties(astarte_device_handle_t device, char *data, int data_len)
{
    char *uncompressed = NULL;
    uLongf uncompressed_len = 0;
    astarte_err_t uncompress_err
        = uncompress_purge_properties(data, data_len, &uncompressed, &uncompressed_len);
    if (uncompress_err != ASTARTE_OK) {
        ESP_LOGE(TAG, "Failed uncompressing the purge properties message.");
        return;
    }

    ESP_LOGD(TAG, "Received purge properties: '%s'", (uncompressed) ? uncompressed : "");

