sorru94/astarte-device-sdk-esp32/src/astarte_device.c
    // Split the payload in individual properties and store them in a list
    astarte_linked_list_handle_t list_handle = astarte_linked_list_init();
    if (uncompressed_len != 0) {
        char *property = strtok(uncompressed, ";");
        if (!property) {
            ESP_LOGE(TAG, "Error parsing the purge property message %s.", uncompressed);
            goto end;
        }
        do {
            astarte_linked_list_item_t list_item
                = { .value = property, .value_len = strlen(property) + 1 };
            if (ASTARTE_OK != astarte_linked_list_append(&list_handle, list_item)) {
                ESP_LOGE(TAG, "Error appending entry to linked list.");
                goto end;
            }
            property = strtok(NULL, ";");
        } while (property);
    }

    // Open storage
    astarte_storage_handle_t storage_handle;
    if (ASTARTE_STORAGE_ERR_OK != astarte_storage_open(&storage_handle)) {
        ESP_LOGE(TAG, "Error opening storage.");
        goto end;
    }

    // Create storage iterator
    astarte_storage_iterator_t storage_iterator;
    astarte_storage_err_t storage_err
        = astarte_storage_iterator_create(storage_handle, &storage_iterator);
    if ((storage_err != ASTARTE_STORAGE_ERR_OK) && (storage_err != ASTARTE_STORAGE_ERR_NOT_FOUND)) {
        ESP_LOGE(TAG, "Error creating the properties iterator %d.", storage_err);
        astarte_storage_close(storage_handle);
        goto end;
    }

    // Iterate through all the properties stored in memory
    while (storage_err != ASTARTE_STORAGE_ERR_NOT_FOUND) {
        // Fetch one property lengths
        size_t interface_name_len = 0;
        size_t path_len = 0;
        size_t value_len = 0;
        storage_err = astarte_storage_iterator_get_property(
            &storage_iterator, NULL, &interface_name_len, NULL, &path_len, NULL, &value_len);
        if (storage_err != ASTARTE_STORAGE_ERR_OK) {
            ESP_LOGE(TAG, "Error fetching property lengths %d.", storage_err);
            astarte_storage_close(storage_handle);
            goto end;
        }

        // Allocate memory for property data
        char *interface_name = calloc(interface_name_len, sizeof(char));
        char *path = calloc(path_len, sizeof(char));
        if ((interface_name == NULL) || (path == NULL)) {
            ESP_LOGE(TAG, "Out of memory %s: %d", __FILE__, __LINE__);
            free(interface_name);
            free(path);
            astarte_storage_close(storage_handle);
            goto end;
        }

        // Fetch one property data
        storage_err = astarte_storage_iterator_get_property(&storage_iterator, interface_name,
            &interface_name_len, path, &path_len, NULL, &value_len);
        if (storage_err != ASTARTE_STORAGE_ERR_OK) {
            ESP_LOGE(TAG, "Error fetching property data %d.", storage_err);
            free(interface_name);
            free(path);
            astarte_storage_close(storage_handle);
            goto end;
        }

        bool advance_iterator = true;
        // Only server owned interfaces should be evaluated
        if (!interface_is_device_owned(device, interface_name)) {
            // Compare against the properties received in the purge prop
            bool find_res = false;
            if (!astarte_linked_list_is_empty(&list_handle)) {
                // Create full property name
                size_t full_prop_len = interface_name_len + path_len - 1;
                char *full_prop = calloc(full_prop_len, sizeof(char));
                full_prop = strncat(strncpy(full_prop, interface_name, full_prop_len), path,
                    full_prop_len - strlen(interface_name) - 1);

                // Find if it's in the purge properties list
                astarte_linked_list_item_t item
                    = { .value = full_prop, .value_len = full_prop_len };
                find_res = astarte_linked_list_find(&list_handle, item);

                // Free full property name
                free(full_prop);
            }

            // If property is not in purge property list, remove it from storage
            if (!find_res) {
                // Check if this is the last property
                bool has_next = false;
                storage_err = astarte_storage_iterator_peak(&storage_iterator, &has_next);
                if (storage_err != ASTARTE_STORAGE_ERR_OK) {
                    ESP_LOGE(TAG, "Error peaking next property: %d.", storage_err);
                    free(interface_name);
                    free(path);
                    astarte_storage_close(storage_handle);
                    goto end;
                }
                // Delete property
                ESP_LOGD(TAG, "Purging property: '%s', '%s'", interface_name, path);
                storage_err = astarte_storage_delete_property(storage_handle, interface_name, path);
                if (storage_err != ASTARTE_STORAGE_ERR_OK) {
                    ESP_LOGE(TAG, "Error deleting the property: %d.", storage_err);
                    free(interface_name);
                    free(path);
                    astarte_storage_close(storage_handle);
                    goto end;
                }
                // If it was the last property, exit
                if (!has_next) {
                    free(interface_name);
                    free(path);
                    astarte_storage_close(storage_handle);
                    goto end;
                }
                advance_iterator = false; // Iterator has been advanced by the delete function
            }
        }

        // Free individual property data
        free(interface_name);
        free(path);

        // Advance the iterator if required
        if (advance_iterator) {
            storage_err = astarte_storage_iterator_advance(&storage_iterator);
            if ((storage_err != ASTARTE_STORAGE_ERR_OK)
                && (storage_err != ASTARTE_STORAGE_ERR_NOT_FOUND)) {
                ESP_LOGE(TAG, "Error iterating through the properties: %d.", storage_err);
                astarte_storage_close(storage_handle);
                goto end;
            }
        }
    }

    // Close storage
    astarte_storage_close(storage_handle);

end:
    // Destroy the linked list
    // No need to free the memory as all the data contained in this list is part of uncompressed
    astarte_linked_list_destroy(&list_handle);
    // Free uncompressed payload
    free(uncompressed);
}

static astarte_err_t uncompress_purge_properties(
    char *data, int data_len, char **output, uLongf *output_len)
{
    char *uncompressed = NULL;
    uLongf uncompressed_len = __builtin_bswap32(*(uint32_t *) data);
    if (uncompressed_len != 0) {
        uncompressed = calloc(uncompressed_len + 1, sizeof(char));
        if (uncompressed == NULL) {
            ESP_LOGE(TAG, "Out of memory %s: %d", __FILE__, __LINE__);
            return ASTARTE_ERR_OUT_OF_MEMORY;
        }
        int uncompress_res = uncompress((char unsigned *) uncompressed, &uncompressed_len,
            (char unsigned *) data + 4, data_len - 4);
        if (uncompress_res != Z_OK) {
            ESP_LOGE(TAG, "Decompression error %d.", uncompress_res);
            free(uncompressed);
            return ASTARTE_ERR;
        }
    }

    *output = uncompressed;
    *output_len = uncompressed_len;
    return ASTARTE_OK;
}

static int has_connectivity()
{
    esp_http_client_config_t config
        = {.url = CONFIG_ASTARTE_CONNECTIVITY_TEST_URL,
#if CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
              .crt_bundle_attach = esp_crt_bundle_attach,
#endif
          };
    esp_http_client_handle_t client = esp_http_client_init(&config);
    esp_err_t err = esp_http_client_perform(client);

    int res = 0;
    const int http_bad_request = 400;
    if ((err == ESP_OK) && (esp_http_client_get_status_code(client) < http_bad_request)) {
        res = 1;
    }
    esp_http_client_cleanup(client);

    return res;
}

